hugo/content/_index.md
+++
title = "Welcome!"
draft = false
toc = false
author = false
+++

I&rsquo;m ****John Lalor****.
I am an Assistant Professor at the [Mendoza College of Business](https://mendoza.nd.edu) at the [University of Notre Dame](https://www.nd.edu).
I completed my Ph.D. at the University of Massachusetts Amherst in the [College of Information and Computer Science](https://cics.umass.edu).
At UMass I was a member of the Bio-NLP group, working with Dr. Hong Yu.
My research interests are in Machine Learning and Natural Language Processing.
I am particularly interested in model evaluation, quantifying uncertainty, and biomedical informatics.

Prior to UMass, I worked as a software developer at Eze Software in Chicago and as an IT Audit Associate for KPMG.
I received my Master&rsquo;s Degree in Computer Science at DePaul University, where I worked on projects in Computer Science Education and Recommender Systems.


## Recent Updates {#recent-updates}

-   **January 2023**: _Evaluating the Efficacy of NoteAid on EHR Note Comprehension among US Veterans through Amazon Mechanical Turk_ accepted at the International Journal of Medical Informatics.
-   **January 2023**: _Business Analytics in Healthcare: Past, Present, and Future Trends_ accepted at Manufacturing and Service Operations Management.
-   **September 2022**: _py-irt: A Scalable Item Response Theory Library for Python_ accepted at the INFORMS Journal on Computing.
